[
  {
    "id": 0,
    "title": "What is an Epidemic?",
    "chapter": 0,
    "level": 0,
    "slides": [
      {
        "text": "When someone is infected by a new disease, it is kind of like gossip in school.",
        "image": "gossip.png"
      },
      {
        "text": "When one of your friends tells a story about someone in your school to your friend group, you and your friends start telling the story to other people - but not everyone you meet.",
        "image": "gossip_not_listening.png"
      },
      {
        "text": "Some people hear the story and pass it on, and others don't. But if enough people keep sharing it, soon almost the whole school knows.",
        "image": "whole_school.png"
      },
      {
        "text": "If we try to keep track of how the gossip spreads, we can't always take each conversation each person had into consideration. Instead, we can do something similar to rolling the dice for each person.",
        "image": "dice.jpg"
      },
      {
        "text": "To see how many people someone tells the gossip to, we can pretend to roll a 4-sided dice for each person - the number it lands on shows how many people they tell. You can see an example for this below. If you click Re-Generate, you can see how re-rolling the dice for each person changes the outcome!",
        "data": {
          "type": "dummy_tree",
          "num_iter": 5
        },
        "vis1": {
          "type": "rad_tree",
          "depth": 4,
          "step": 50
        }
      },
      {
        "text": "Now you can also try changing the slider around to see how the gossip spreads day-by-day. Each ring represents a new day.",
        "data": {
          "type": "dummy_tree",
          "num_iter": 5
        },
        "vis1": {
          "type": "rad_tree",
          "depth": 0,
          "step": 50
        },
        "sliders": [
          {
            "type": "depth",
            "min": 0,
            "max": 5,
            "current_value": 0,
            "symbol": "sun",
            "text": "days"
          }
        ]
      },
      {
        "text": "A disease spreads the same way, one person might only infect a few other people, but when they also start infecting other people, the disease starts spreading faster and faster! That is how an epidemic starts.",
        "data": {
          "type": "dummy_tree",
          "num_iter": 5
        },
        "vis1": {
          "type": "rad_tree",
          "depth": 5,
          "step": 50
        },
        "sliders": [
          {
            "type": "depth",
            "min": 0,
            "max": 5,
            "current_value": 5,
            "symbol": "sun",
            "text": "days"
          }
        ]
      }
    ],
    "progress": 7
  },
  {
    "id": 1,
    "title": "Motivation for Epidemic Visualization",
    "chapter": 1,
    "level": 0,
    "slides": [
      {
        "text": "To better understand the spreading of diseases, we need a way to visualize the number of people getting infected day by day.",
        "image": ""
      },
      {
        "text": "Seeing the number of daily infections or hospitalizations caused by a disease can help doctors estimate the need of hospital beds.",
        "image": ""
      },
      {
        "text": "And it also lets us see if we need to war masks or should avoid going to public spaces like school or the mall.",
        "image": ""
      }
    ],
    "progress": 2
  },
  {
    "id": 2,
    "title": "Line Plots",
    "chapter": 1,
    "level": 1,
    "slides": [
      {
        "text": "Line plots are one of the most common ways to show the relation between two things.",
        "image": ""
      },
      {
        "text": "You could think of how the temperature changes during a day hour by hour.",
        "vis1": {
          "type": "line_plot",
          "temps": true
        }
      },
      {
        "text": "We can start to understand line plots by going back to our gossip example. Imagine the first axis showing how many days have passed since the gossip started spreading",
        "todo": "add interactive line for demo"
      },
      {
        "text": "Now imagine the second axis showing the number of people that have heard the gossip.",
        "todo": "add interactive line for demo"
      },
      {
        "text": "If we combine the two, we can draw two lines, one from the day axis and an other from the people axis and draw a dot where they intersect.",
        "todo": "add  image for this"
      },
      {
        "text": "We can repeat this, drawing a dot for each day.",
        "todo": "add  image for this"
      },
      {
        "text": "If we connect these dots, we get a line plot! Try hovering with your mouse over the plot to see what each point means.",
        "todo": "add interaction for this where line plot also contains dots for easier understanding"
      },
      {
        "text": "test",
        "data": {
          "type": "dummy_tree",
          "num_iter": 5
        },
        "vis1": {
          "type": "line_plot"
        },
        "vis2": {
          "type": "rad_tree",
          "depth": 4,
          "step": 50
        },
        "sliders": [
          {
            "type": "days",
            "min": 0,
            "max": 5,
            "symbol": "sun",
            "text": "days"
          }
        ]
      }
    ],
    "progress": 3
  },
  {
    "id": 3,
    "title": "Test Story",
    "chapter": 1,
    "level": 1,
    "slides": [
      {
        "text": "Structure Demo"
      }
    ],
    "progress": 1
  }
]