[
  {
    "id": 0,
    "title": "What is an Epidemic?",
    "chapter": 0,
    "level": 0,
    "slides": [
      {
        "text": "When someone is infected by a new disease, it is kind of like gossip in school.",
        "image": "gossip.png"
      },
      {
        "text": "When one of your friends tells a story about someone in your school to your friend group, you and your friends start telling the story to other people - but not everyone you meet.",
        "image": "gossip_not_listening.png"
      },
      {
        "text": "Some people hear the story and pass it on, and others don't. But if enough people keep sharing it, soon almost the whole school knows.",
        "image": "whole_school.png"
      },
      {
        "text": "If we try to keep track of how the gossip spreads, we can't always take each conversation each person had into consideration. Instead, we can do something similar to rolling the dice for each person.",
        "image": "dice.jpg"
      },
      {
        "text": "To see how many people someone tells the gossip to, we can pretend to roll a 4-sided dice for each person - the number it lands on shows how many people they tell. You can see an example for this below. If you click Re-Generate, you can see how re-rolling the dice for each person changes the outcome!",
        "data": {
          "type": "dummy_tree",
          "num_iter": 5
        },
        "vis1": {
          "type": "rad_tree",
          "depth": 4,
          "step": 50
        }
      },
      {
        "text": "Now you can also try changing the slider around to see how the gossip spreads day-by-day. Each ring represents a new day.",
        "data": {
          "type": "dummy_tree",
          "num_iter": 5
        },
        "vis1": {
          "type": "rad_tree",
          "depth": 0,
          "step": 50
        },
        "sliders": [
          {
            "type": "depth",
            "min": 0,
            "max": 5,
            "current_value": 0,
            "symbol": "sun",
            "text": "days"
          }
        ]
      },
      {
        "text": "A disease spreads the same way, one person might only infect a few other people, but when they also start infecting other people, the disease starts spreading faster and faster! That is how an epidemic starts.",
        "data": {
          "type": "dummy_tree",
          "num_iter": 5
        },
        "vis1": {
          "type": "rad_tree",
          "depth": 5,
          "step": 50
        },
        "sliders": [
          {
            "type": "depth",
            "min": 0,
            "max": 5,
            "current_value": 5,
            "symbol": "sun",
            "text": "days"
          }
        ]
      }
    ],
    "progress": 1
  },
  {
    "id": 1,
    "title": "Motivation for Epidemic Visualization",
    "chapter": 1,
    "level": 0,
    "slides": [
      {
        "text": "To better understand the spreading of diseases, we need a way to visualize the number of people getting infected day by day.",
        "image": ""
      },
      {
        "text": "Seeing the number of daily infections or hospitalizations caused by a disease can help doctors estimate the need of hospital beds.",
        "image": ""
      },
      {
        "text": "And it also lets us see if we need to war masks or should avoid going to public spaces like school or the mall.",
        "image": ""
      }
    ],
    "progress": 2
  },
  {
    "id": 2,
    "title": "Line Plots",
    "chapter": 1,
    "level": 1,
    "slides": [
      {
        "text": "Line plots are one of the most common ways to show the relation between two things.",
        "image": ""
      },
      {
        "text": "You could think of how the temperature changes during a day hour by hour.",
        "vis1": {
          "type": "line_plot",
          "temps": true,
          "y_lab": "temperature",
          "x_lab": "hours"
        }
      },
      {
        "text": "The two related things in this case are the hours of the day and the temperatures measured.",
        "image": "time_temp_rel.png"
      },
      {
        "text": "We can represent each on a scale like this. These scales are essentially just some lines with marks and numbers.",
        "image": "x_scale.png"
      },
      {
        "text": "The number at the first mark is the smallest number we plan to include in our scale, in this case, this is 0. Numbers after this one show the distance between two marks.",
        "image": "x_scale_zero.png"
      },
      {
        "text": "To calculate the distance between two marks, you can take two numbers at different marks, subtract the smaller from the larger one and and divide this by the number of marks between the two numbers. You can see how to do this again below.",
        "image": "step_size.png"
      },
      {
        "text": "Let's say that this scale represents the hours in a day. The first mark is at 0, and the last is at 23. The distance between each marking is 2. Now we can add some hours as dots. If we want to add hours 0, 5, 12, and 23, we can use the numbers at the marks and the distance between them, to find their place.",
        "vis1": {
          "type": "line_plot",
          "demo_num": true,
          "only_show_x": true,
          "x_lab": "hours"
        }
      },
      {
        "text": "Now that we have our scale for the hours, we can add an other one like this for the temperatures. It works just like the other one, you just need to count upwards instead of counting to the right.",
        "vis1": {
          "type": "line_plot",
          "temps": true,
          "draw_line": false,
          "show_dots": false,
          "y_lab": "temperature",
          "x_lab": "hours"
        }
      },
      {
        "text": "Now that we have two scales, we also need two values so that we can add a dot. Let's say that the temperature at 12 o'clock was 20 degrees. To add a dot for this, we can count to 5 on the time scale and 10 on the temperature scale. Now, if we draw a line from both scales, we get the place of our new dot. This dot means that the temperature at 5 o'clock was 10 degrees.",
        "image": "temp_at_time.png"
      },
      {
        "text": "Here are some more examples for you to see how this works. The red dot means that at 2 o'clock, the temperature was 2 degrees. The yellow dot means that at 7 o'clock, the temperature was 10 degrees. The blue dot means that at 14 o'clock, the temperature was 5 degrees.",
        "image": "colored_points.png"
      },
      {
        "text": "Now that we understan how it is done, we can add a dot for each temperature at each time and get something like this. If you use your mouse to hover over a dot, you can see how it was drawn and what it means. A line plot is drawn, by connecting the dots using lines like the ones connecting the dots here, but it is usually drawn without the dots.",
        "vis1": {
          "type": "line_plot",
          "temps": true,
          "y_lab": "temperature",
          "x_lab": "hours"
        }
      },
      {
        "text": "test",
        "data": {
          "type": "dummy_tree",
          "num_iter": 5
        },
        "vis1": {
          "type": "line_plot"
        },
        "vis2": {
          "type": "rad_tree",
          "depth": 4,
          "step": 50
        },
        "sliders": [
          {
            "type": "days",
            "min": 0,
            "max": 5,
            "symbol": "sun",
            "text": "days"
          }
        ]
      }
    ],
    "progress": 12
  },
  {
    "id": 3,
    "title": "Test Story",
    "chapter": 1,
    "level": 1,
    "slides": [
      {
        "text": "Structure Demo"
      }
    ],
    "progress": 1
  }
]